{"name":"RBLDesigns","headerTaglineOne":"Wassup Foo 🤘","headerTaglineTwo":"Im Salem.","headerTaglineThree":"Web Developer, Cloud Engineer & Sick Ass Foo.","headerTaglineFour":" Based out of SurCalifas.","showCursor":false,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/salemaziel"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in"},{"id":"3","title":"Twitter","link":"https://twitter.com/"},{"id":"4","title":"Blog","link":"https://salemaziel.oldschoolyouth.com/"},{"id":"5","title":"Email","link":"mailto:queondaguey@viadelweb.com"}],"projects":[{"id":"1","title":"Project One Test","description":"Web Design","imageSrc":"https://images.unsplash.com/photo-1487837647815-bbc1f30cd0d2?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8Njl8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://salemaziel.com"},{"id":"2","title":"Project Two","description":"Web Development","imageSrc":"https://images.unsplash.com/photo-1605153864431-a2795a1b2f95?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxjb2xsZWN0aW9uLXBhZ2V8MXwyNTY3ODl8fGVufDB8fHw%3D&auto=format&fit=crop&w=400&q=60","url":"https://salemaziel.com/"},{"id":"3","title":"Project Three","description":"Design","imageSrc":"https://images.unsplash.com/photo-1504083898675-c896ecdae86e?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjJ8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://salemaziel.com/"},{"id":"4","title":"Project Four","description":"Marketing","imageSrc":"https://images.unsplash.com/photo-1492171983775-a51717616c0d?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8NjB8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://salemaziel.com/"},{"id":"5","title":"Project Five","description":"Development","imageSrc":"https://images.unsplash.com/photo-1534239143101-1b1c627395c5?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8NzZ8fHBhc3RlbHxlbnwwfHwwfA%3D%3D&auto=format&fit=crop&w=400&q=60","url":"https://salemaziel.com/"},{"id":"6","title":"Project Six","description":"Design & Development","imageSrc":"https://images.unsplash.com/photo-1517479149777-5f3b1511d5ad?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTAyfHxwYXN0ZWx8ZW58MHx8MHw%3D&auto=format&fit=crop&w=400&q=60","url":"https://salemaziel.com/"}],"services":[{"id":"1","title":"Web Design & Development","description":"We build and optimize your online presence.  Website is the digital entry point into your business and a powerful potential revenue channel, and the real estate on which your digital presence is built."},{"id":"2","title":"Website Hosting","description":"We provide quick, reliable and secure web hosting services for your website using modern CMS platforms and the latest tech frameworks to ensure your website is always fast and always online."},{"id":"3","title":"Technical SEO Audits","description":"We provide SEO consulting services, performing technical SEO audits that go deeper than just surface level SEO recommendations, provide you with a detailed report of any the technical issues, such as website structure, that are preventing your website from ranking higher in search engines, and solutions to fix them."},{"id":"4","title":"Remote Work Solutions","description":"We provide remote work solutions for businesses, freelancers, and aspire entrepeneurs. We can help you set up your remote work infrastructure, provide you or your company with the tools and resources needed to work remotely while maintaining productivity and security."},{"id":"5","title":"Fully Managed Open-Source App Hosting","description":"We provide fully managed hosting services for dozens of privacy friendly open-source self-hostable  apps. Stop leaving all your important business data in the hands of big corporations who dont give a shit about you, and start taking back control and ownership of your data; from who has it, to where it's stored, to how many backups to keep. From website platforms like WordPress, GhostCMS, and Magenta, to finance manages like Firefly, customizable invoicing automation tools like Invoice Ninja, team chat collaboration tools like Mattermost and RocketChat, decentralized social platforms and forums for building communities, CRM's for managing customer relationships, file storage and document sharing solutions, marketing automation tools like Mautic and ListMonk, to email servers with your custom domain, your own personal search engine using SearX, modern secure and blazing fast VPN tunnels using Wireguard, and even your own custom branded video call platform using Jitsi Meet, Nextcloud Talk, Kopano Meet, and so much more. We take care of all the technical aspects to ensure your data stays in your control, so you can focus solely on your business."},{"id":"6","title":"Guided Self-Hosting: Open-Source App Hosting with Support","description":"We also offer guided self-hosting for those who want to dive a little deeper into the world of self-hosting. Our team will guide you through the process of setting up your server, installing the necessary software, and ensuring reliability of your self-hosted services as you learn. We'll be with you every step of the way to ensure that your webapp or service is up and running smoothly."},{"id":"7","title":"No Bullshit Marketing Strategy Feedback","description":"We provide consulting services to strategize your advertising campaigns. More importantly, we provide no-bullshit feedback on potential reactions to marketing strategies; especially useful for companies who... let's say, might be currently lacking in the Diversity & Inclusion department a bit. Whether its just a temporary situation for your business, a bigger issue in company culture that needs addressing, or completely in denial about the reasons for employees being majority white but still want to avoid having your business get 'cancelled', we can fill that role to point out any potential blindspots and the potential risks your business might face."},{"id":"8","title":"General Tech Support","description":"We provide general tech support for your home or business. We can help you set up your home network, install and configure your new router, set up your new laptop, fix or revive your old one, and even help you set up your new smart home devices securely."}],"aboutpara":"I'm Mexican-American. I'm a web developer. I'm a graffiti artist. I'm a Systems Adminstrator. I'm a writer, or atleast I try to be. I love to learn new things, and I love to teach others what I've learned. I'm a big fan of open-source software. I like reading books, running, hiking, going skydiving, and on spontaneous roadtrips. I don't play much video games, but I can almost definitely merk you at handball; and I aint talkin bout no red cherry balls, ain't shit sweet about handball - you'll probably find more about articles about it by googling 'Prisonball'. Here's a quick San Quentin News post about it: https://sanquentinnews.com/wall-balltherapy/ ","resume":{"tagline":"👋  I'm a software engineer, product designer.","description":"I have delivered world-class user experiences to millions of people. Well-versed with React, Javascript, and most of the Web frameworks.","experiences":[{"id":"1","dates":"March 2022 - Present","type":"Full Time","position":"Frontend Engineer at X","bullets":"Bullet One, Bullet Two"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"July 2020 - March 2022","type":"Full Time","position":"Frontend Engineer at X","bullets":"Worked on the frontend of a React application, Worked on the frontend of a React application"}],"education":{"universityName":"University of California, Santa Barbara","universityDate":"2012-2014","universityPara":"Transferred from Palomar Community College; Graduated with a Bachelor's Degree in Psychology and Minors in Education and Philosophy."},"languages and syntaxes":["Javascript","HTML5/CSS","Python","Bash","Yaml","Markdown","JSON","Ansible Playbooks","English","Spanish","Sarcasm"],"frameworks and protocols":["React","Typescript","NodeJs","Express","NextJs","Gatsby","GraphQL","REST","OpenVPN","Wireguard","SSH","Society Norms (mostly)"],"others":["AWS","GCP","Azure","Digital Ocean","Linode","Vultr","GNU/Linux","Nginx","Apache","Caddy","HaProxy","Docker","Ansible","Git"]}}